# Ex1 - Filtering and Sorting Data

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

### Step 3. Assign it to a variable called chipo.

In [25]:
chipo = pd.read_excel('chipo.xlsx')

### Step 4. How many products cost more than $10.00?

In [52]:
products = chipo[chipo['item_price']>10]
products['item_name'].size

1130

### Step 5. What is the price of each item? 
###### print a data frame with only two columns item_name and item_price

In [55]:
price = chipo[['item_name','item_price']]
price

                                  item_name  item_price
0              Chips and Fresh Tomato Salsa        2.39
1                                      Izze        3.39
2                          Nantucket Nectar        3.39
3     Chips and Tomatillo-Green Chili Salsa        2.39
4                              Chicken Bowl       16.98
...                                     ...         ...
4618                          Steak Burrito       11.75
4619                     Chicken Salad Bowl       11.25
4620                     Chicken Salad Bowl        8.75
4621                     Chicken Salad Bowl        8.75
4622                                    NaN         NaN

[4623 rows x 2 columns]

### Step 6. Sort by the name of the item

In [57]:
chipo.sort_values("item_name")

,order_id,quantity,item_name,choice_description,item_price
3389,1360,2.0,6 Pack Soft Drink,[Diet Coke],12.98
341,148,1.0,6 Pack Soft Drink,[Diet Coke],6.49
1849,749,1.0,6 Pack Soft Drink,[Coke],6.49
1860,754,1.0,6 Pack Soft Drink,[Diet Coke],6.49
2713,1076,1.0,6 Pack Soft Drink,[Coke],6.49
...,...,...,...,...,...
781,322,1.0,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Black Beans, Cheese, Sou...",8.75
2851,1132,1.0,Veggie Soft Tacos,"[Roasted Chili Corn Salsa (Medium), [Black Bea...",8.49
1699,688,1.0,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25
1395,567,1.0,Veggie Soft Tacos,"[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice...",8.49
4622,,NaN,NaN,NaN,NaN

### Step 7. What was the quantity of the most expensive item ordered?

In [116]:
quantity1 = chipo[chipo['item_price']> 40]['quantity']
quantity1

3598    15.0
Name: quantity, dtype: float64

### Step 8. How many times was a Veggie Salad Bowl ordered?

In [198]:

ordered = chipo[chipo.item_name=='Veggie Salad Bowl']
len(ordered)

18

### Step 9. How many times did someone order more than one Canned Soda?

In [199]:
orders = chipo[(chipo.item_name=='Canned Soda') & (chipo.quantity>1)]
len(orders)

20